In [365]:
import pandas as pd
import numpy as np
import os
import sys
import matplotlib.pyplot as plt
import seaborn as sns
import re
from datetime import datetime
import warnings
warnings.filterwarnings('ignore')

# Add Dash for interactive web dashboards
import dash
from dash import dcc, html, Input, Output, callback

In [366]:
# Housing price indices with proper encoding handling

# Try to load Excel file with graceful error handling if xlrd is missing
try:
    government_supported_housing = pd.read_excel('/home/unsmartboy/Documents/housing_forecast/housing_price/data/국고보조사업 분야별 예산 현황(비중표).xls', header=1)
    print("Excel file loaded successfully")
except ImportError:
    print("Warning: Excel file could not be loaded. Missing 'xlrd' dependency.")
    print("To fix: Run 'pip install xlrd>=2.0.1' in your environment")
    government_supported_housing = pd.DataFrame()  # Create empty DataFrame as fallback

# Continue with other CSV file loading
try:
    housing_price_index1 = pd.read_csv('/home/unsmartboy/Documents/housing_forecast/housing_price/data/408_DT_40803_N0001_20250511202745.csv', encoding='utf-8')
except UnicodeDecodeError:
    housing_price_index1 = pd.read_csv('/home/unsmartboy/Documents/housing_forecast/housing_price/data/408_DT_40803_N0001_20250511202745.csv', encoding='cp949')
try:
    unsold_housing = pd.read_csv('/home/unsmartboy/Documents/housing_forecast/housing_price/data/Unsold_Housings__Total__20250511201332.csv', encoding='utf-8')
except UnicodeDecodeError:
    unsold_housing = pd.read_csv('/home/unsmartboy/Documents/housing_forecast/housing_price/data/Unsold_Housings__Total__20250511201332.csv', encoding='cp949')
try:
    housing_price_index2 = pd.read_csv('/home/unsmartboy/Documents/housing_forecast/housing_price/data/408_DT_40803_N0003_20250511203207.csv', encoding='utf-8')
except UnicodeDecodeError:
    housing_price_index2 = pd.read_csv('/home/unsmartboy/Documents/housing_forecast/housing_price/data/408_DT_40803_N0003_20250511203207.csv', encoding='cp949')

try:
    housing_price_index3 = pd.read_csv('/home/unsmartboy/Documents/housing_forecast/housing_price/data/408_DT_40803_N0001_20250511203003.csv', encoding='utf-8')
except UnicodeDecodeError:
    housing_price_index3 = pd.read_csv('/home/unsmartboy/Documents/housing_forecast/housing_price/data/408_DT_40803_N0001_20250511203003.csv', encoding='cp949')

# Expenses data with encoding handling
try:
    expenses_by_year1 = pd.read_csv('/home/unsmartboy/Documents/housing_forecast/housing_price/data/Average_monthly_income__expenditure__urban_excl.1_person_and_farm__20250511200700.csv', encoding='utf-8')
except UnicodeDecodeError:
    expenses_by_year1 = pd.read_csv('/home/unsmartboy/Documents/housing_forecast/housing_price/data/Average_monthly_income__expenditure__urban_excl.1_person_and_farm__20250511200700.csv', encoding='cp949')

try:
    expenses_by_year2 = pd.read_csv('/home/unsmartboy/Documents/housing_forecast/housing_price/data/Average_monthly_income__expenditure__whole_excl.1_person_and_farm__20250511200421.csv', encoding='utf-8')
except UnicodeDecodeError:
    expenses_by_year2 = pd.read_csv('/home/unsmartboy/Documents/housing_forecast/housing_price/data/Average_monthly_income__expenditure__whole_excl.1_person_and_farm__20250511200421.csv', encoding='cp949')

# Housing data with encoding handling
try:
    housing_price_index_by_housingtype = pd.read_csv('/home/unsmartboy/Documents/housing_forecast/housing_price/data/Housing_Transaction_Price_Index_by_House_Type__2011.6100__20250511205317.csv', encoding='utf-8')
except UnicodeDecodeError:
    housing_price_index_by_housingtype = pd.read_csv('/home/unsmartboy/Documents/housing_forecast/housing_price/data/Housing_Transaction_Price_Index_by_House_Type__2011.6100__20250511205317.csv', encoding='cp949')

try:
    number_house_owners_byage = pd.read_csv('/home/unsmartboy/Documents/housing_forecast/housing_price/data/Number_of_house_ownership_and_nonownership_households_by_residence_area_20250511203944.csv', encoding='utf-8')
except UnicodeDecodeError:
    number_house_owners_byage = pd.read_csv('/home/unsmartboy/Documents/housing_forecast/housing_price/data/Number_of_house_ownership_and_nonownership_households_by_residence_area_20250511203944.csv', encoding='cp949')

try:
    house_ownership_nonownership = pd.read_csv('/home/unsmartboy/Documents/housing_forecast/housing_price/data/Number_of_house_ownership_and_nonownership_households_by_residence_area_20250511203944.csv', encoding='utf-8')
except UnicodeDecodeError:
    house_ownership_nonownership = pd.read_csv('/home/unsmartboy/Documents/housing_forecast/housing_price/data/Number_of_house_ownership_and_nonownership_households_by_residence_area_20250511203944.csv', encoding='cp949')

try:
    number_houses_per1000 = pd.read_csv('/home/unsmartboy/Documents/housing_forecast/housing_price/data/Number_of_Houses_per_1_000_people_20250511203641.csv', encoding='utf-8')
except UnicodeDecodeError:
    number_houses_per1000 = pd.read_csv('/home/unsmartboy/Documents/housing_forecast/housing_price/data/Number_of_Houses_per_1_000_people_20250511203641.csv', encoding='cp949')

try:
    transaction_based_index = pd.read_csv('/home/unsmartboy/Documents/housing_forecast/housing_price/data/Transactionbased_Sales_Price_Indices_2017.11100.0__20250511201206.csv', encoding='utf-8')
except UnicodeDecodeError:
    transaction_based_index = pd.read_csv('/home/unsmartboy/Documents/housing_forecast/housing_price/data/Transactionbased_Sales_Price_Indices_2017.11100.0__20250511201206.csv', encoding='cp949')

# Unsold housing data with encoding handling
try:
    unsold_housing = pd.read_csv('/home/unsmartboy/Documents/housing_forecast/housing_price/data/Unsold_Housings__Total__20250511201332.csv', encoding='utf-8')
except UnicodeDecodeError:
    try:
        unsold_housing = pd.read_csv('/home/unsmartboy/Documents/housing_forecast/housing_price/data/Unsold_Housings__Total__20250511201332.csv', encoding='cp949')
    except UnicodeDecodeError:
        try:
            unsold_housing = pd.read_csv('/home/unsmartboy/Documents/housing_forecast/housing_price/data/Unsold_Housings__Total__20250511201332.csv', encoding='euc-kr')
        except UnicodeDecodeError:
            unsold_housing = pd.read_csv('/home/unsmartboy/Documents/housing_forecast/housing_price/data/Unsold_Housings__Total__20250511201332.csv', encoding='latin-1')

print("All datasets loaded successfully!")
print(f"Loaded {len([housing_price_index1, housing_price_index2, housing_price_index3, expenses_by_year1, expenses_by_year2, housing_price_index_by_housingtype, number_house_owners_byage, house_ownership_nonownership, number_houses_per1000, transaction_based_index, unsold_housing, unsold_housing, government_supported_housing])} datasets")

Excel file loaded successfully
All datasets loaded successfully!
Loaded 13 datasets

In [368]:
government_supported_housing.head()

   NO  회계연도       분야   예산액(억원)   비중(%)
0   1  2025  일반·지방행정      5268     0.5
1   2  2025  공공질서및안전     16212     1.4
2   3  2025    통일·외교     12415     1.1
3   4  2025       국방       514     0.0
4   5  2025       교육     76384     6.8

In [369]:
government_supported_housing.tail()

    NO  회계연도           분야   예산액(억원)   비중(%)
10  11  2025  산업·중소기업및에너지     54378     4.8
11  12  2025        교통및물류     35222     3.1
12  13  2025           통신      1870     0.2
13  14  2025      국토및지역개발     16435     1.5
14  15  2025         과학기술      1060     0.1

In [370]:
def rename_government_housing_columns(df):
    """
    Rename columns from Korean to English for government supported housing data.
    
    Parameters:
    df (pandas.DataFrame): Input dataframe with Korean column names
    
    Returns:
    pandas.DataFrame: Dataframe with English column names and translated values
    """
    
    # Make a copy to avoid modifying the original
    df_renamed = df.copy()
    
    # Step 1: Create translation mapping for sector values
    sector_translation = {
        '분야': 'Sector',
        '일반·지방행정': 'General_Local_Administration',
        '공공질서및안전': 'Public_Order_and_Safety',
        '통일·외교': 'Unification_and_Diplomacy',
        '국방': 'National_Defense',
        '교육': 'Education',
        '문화및관광': 'Culture_and_Tourism',
        '환경': 'Environment',
        '사회복지': 'Social_Welfare',
        '보건': 'Health',
        '농림수산': 'Agriculture_Forestry_Fisheries',
        '산업·중소기업및에너지': 'Industry_SME_and_Energy',
        '교통및물류': 'Transportation_and_Logistics',
        '통신': 'Communications',
        '국토및지역개발': 'National_Territory_Regional_Development',
        '과학기술': 'Science_and_Technology'
    }
    
    # Step 2: Apply translation to ALL columns that might contain Korean text
    for col in df_renamed.columns:
        if df_renamed[col].dtype == 'object':  # Only process text columns
            df_renamed[col] = df_renamed[col].replace(sector_translation)
    
    # Step 3: Rename columns
    column_mapping = {
        'NO': 'No',
        'No': 'No',  # In case it's already partially renamed
        '회계연도': 'Fiscal_Year',
        'Fiscal_Year': 'Fiscal_Year',  # In case it's already partially renamed
        'Unnamed: 2': 'Sector',
        ' 분야': 'Sector',
        ' 예산액(억원)': 'Budget_Amount_100M_KRW',
        ' 비중(%)': 'Percentage'
    }
    
    # Apply column renaming
    df_renamed = df_renamed.rename(columns=column_mapping)
    
    return df_renamed
government_supported_housing = rename_government_housing_columns(government_supported_housing)
# Display the first few rows of the renamed DataFrame
government_supported_housing.head()

,No,Fiscal_Year,Sector,Budget_Amount_100M_KRW,Percentage
0,1,2025,General_Local_Administration,5268,0.5
1,2,2025,Public_Order_and_Safety,16212,1.4
2,3,2025,Unification_and_Diplomacy,12415,1.1
3,4,2025,National_Defense,514,0.0
4,5,2025,Education,76384,6.8

In [371]:
housing_price_index1.head()

Empty DataFrame
Columns: [Type, Region, PERIOD, Sales Price Index, Unnamed: 4]
Index: []

In [372]:
housing_price_index2.head()

Empty DataFrame
Columns: [Type, Region, Scale, PERIOD, Sales Price Index, Unnamed: 5]
Index: []

In [373]:
housing_price_index3.head()

Empty DataFrame
Columns: [Type, Region, PERIOD, Sales Price Index, Unnamed: 4]
Index: []

In [374]:
combined_housing_price_index = pd.concat([housing_price_index1, housing_price_index2, housing_price_index3], ignore_index=True)
combined_housing_price_index.head()

Empty DataFrame
Columns: [Type, Region, PERIOD, Sales Price Index, Unnamed: 4, Scale, Unnamed: 5]
Index: []

In [375]:
combined_housing_price_index.drop(columns=['Unnamed: 4', 'Unnamed: 5', 'Scale'], inplace=True)
combined_housing_price_index.head()

Empty DataFrame
Columns: [Type, Region, PERIOD, Sales Price Index]
Index: []

In [376]:
# save combined housing price index to CSV
combined_housing_price_index.to_csv('/home/unsmartboy/Documents/housing_forecast/processed_data/house_price.csv', index=False)

In [377]:
expenses_by_year1.head()

,By the item of monthly income & expenditure of household,1990.1/4,1990.1/4.1,1990.1/4.2,1990.2/4,1990.2/4.1,1990.2/4.2,1990.3/4,1990.3/4.1,1990.3/4.2,...,2019.1/4.2,2019.2/4,2019.2/4.1,2019.2/4.2,2019.3/4,2019.3/4.1,2019.3/4.2,2019.4/4,2019.4/4.1,2019.4/4.2
0,By the item of monthly income & expenditure of...,All households,Salary & wage earners' households,Other households,All households,Salary & wage earners' households,Other households,All households,Salary & wage earners' households,Other households,...,Other households,All households,Salary & wage earners' households,Other households,All households,Salary & wage earners' households,Other households,All households,Salary & wage earners' households,Other households
1,The number of hosehold members (Person),4.00,3.97,4.05,3.98,3.97,4.02,4.01,3.98,4.06,...,2.88,3.07,3.18,2.90,3.06,3.18,2.88,3.07,3.19,2.89
2,Age of household's head (Age),38.67,37.11,41.85,38.66,37.23,41.65,38.74,37.30,41.75,...,59.02,53.17,49.51,58.75,53.21,49.52,58.83,53.34,49.67,59.03
3,Distribution of households (%),100.00,67.17,32.83,100.00,67.66,32.34,100.00,67.78,32.22,...,40.94,100.00,60.41,39.59,100.00,60.33,39.67,100.00,60.74,39.26
4,Income (Won),880499,890099,860860,893567,893907,892856,955067,978042,906743,...,3846639,4802320,5374467,3929180,4983946,5690639,3909227,4880947,5494686,3931339

In [378]:
expenses_by_year2.head()

,By the item of monthly income & expenditure of household,2003.1/4,2003.1/4.1,2003.1/4.2,2003.2/4,2003.2/4.1,2003.2/4.2,2003.3/4,2003.3/4.1,2003.3/4.2,...,2019.1/4.2,2019.2/4,2019.2/4.1,2019.2/4.2,2019.3/4,2019.3/4.1,2019.3/4.2,2019.4/4,2019.4/4.1,2019.4/4.2
0,By the item of monthly income & expenditure of...,All households,Salary & wage earners' households,Other households,All households,Salary & wage earners' households,Other households,All households,Salary & wage earners' households,Other households,...,Other households,All households,Salary & wage earners' households,Other households,All households,Salary & wage earners' households,Other households,All households,Salary & wage earners' households,Other households
1,The number of hosehold members (Person),3.46,3.53,3.37,3.45,3.51,3.36,3.44,3.50,3.36,...,2.86,3.06,3.18,2.88,3.05,3.18,2.86,3.06,3.19,2.87
2,Age of household's head (Age),44.78,41.81,48.85,44.90,42.00,49.06,45.05,42.36,48.77,...,59.15,53.41,49.64,59.00,53.51,49.73,59.08,53.68,49.92,59.30
3,Distribution of households (%),100.00,57.76,42.24,100.00,58.95,41.05,100.00,58.11,41.89,...,41.87,100.00,59.74,40.26,100.00,59.50,40.51,100.00,59.93,40.07
4,Income (Won),2582089,2845840,2221416,2558371,2788401,2228076,2672267,2964442,2266949,...,3740508,4704176,5296373,3825333,4876856,5609633,3800549,4771921,5411583,3815300

In [379]:
combined_expenses = pd.concat([expenses_by_year1, expenses_by_year2], ignore_index=True)
combined_expenses.head()

,By the item of monthly income & expenditure of household,1990.1/4,1990.1/4.1,1990.1/4.2,1990.2/4,1990.2/4.1,1990.2/4.2,1990.3/4,1990.3/4.1,1990.3/4.2,...,2019.1/4.2,2019.2/4,2019.2/4.1,2019.2/4.2,2019.3/4,2019.3/4.1,2019.3/4.2,2019.4/4,2019.4/4.1,2019.4/4.2
0,By the item of monthly income & expenditure of...,All households,Salary & wage earners' households,Other households,All households,Salary & wage earners' households,Other households,All households,Salary & wage earners' households,Other households,...,Other households,All households,Salary & wage earners' households,Other households,All households,Salary & wage earners' households,Other households,All households,Salary & wage earners' households,Other households
1,The number of hosehold members (Person),4.00,3.97,4.05,3.98,3.97,4.02,4.01,3.98,4.06,...,2.88,3.07,3.18,2.90,3.06,3.18,2.88,3.07,3.19,2.89
2,Age of household's head (Age),38.67,37.11,41.85,38.66,37.23,41.65,38.74,37.30,41.75,...,59.02,53.17,49.51,58.75,53.21,49.52,58.83,53.34,49.67,59.03
3,Distribution of households (%),100.00,67.17,32.83,100.00,67.66,32.34,100.00,67.78,32.22,...,40.94,100.00,60.41,39.59,100.00,60.33,39.67,100.00,60.74,39.26
4,Income (Won),880499,890099,860860,893567,893907,892856,955067,978042,906743,...,3846639,4802320,5374467,3929180,4983946,5690639,3909227,4880947,5494686,3931339

In [380]:
def transform_to_long_format(df):
    """Transform wide format to long format"""
    # Ensure the required column exists
    if 'By the item of monthly income & expenditure of household' not in df.columns:
        raise ValueError("The required column is missing in the input DataFrame.")
    
    # Reset index to make the row labels into columns
    df_reset = df.reset_index()
    
    # Melt the DataFrame
    df_long = pd.melt(df_reset, 
                      id_vars=['By the item of monthly income & expenditure of household'],
                      var_name='time_period', 
                      value_name='value')
    
    # Clean up the column names
    df_long = df_long.rename(columns={
        'By the item of monthly income & expenditure of household': 'metric'
    })
    
    return df_long

# Method 2: Create separate DataFrames for different metrics
def separate_by_metrics(df):
    """Create separate DataFrames for each metric type"""
    metrics = {
        'household_members': df.iloc[0],
        'household_head_age': df.iloc[1], 
        'income_distribution': df.iloc[2],
        'income_amount': df.iloc[3]
    }
    
    # Convert each to DataFrame with proper column names
    result = {}
    for metric_name, series in metrics.items():
        result[metric_name] = pd.DataFrame({
            'time_period': series.index,
            'value': series.values
        })
    
    return result

# Method 3: Extract time periods and household types
def parse_column_structure(df):
    """Parse the complex column structure"""
    # Extract time periods (years/quarters)
    time_periods = []
    household_types = []
    
    for col in df.columns:
        # Extract year/quarter info
        if isinstance(col, str):
            time_periods.append(col)
            # You'll need to categorize household types based on your column names
            if 'All households' in str(col):
                household_types.append('All households')
            elif 'Salary' in str(col):
                household_types.append('Salary & wage earners')
            elif 'Other' in str(col):
                household_types.append('Other households')
            else:
                household_types.append('Unknown')
    
    return time_periods, household_types

# Method 4: Create a clean summary table
def create_summary_table(df):
    """Create a clean summary with meaningful labels"""
    
    # Define better metric names
    metric_labels = {
        0: 'Average Household Size (persons)',
        1: 'Average Age of Household Head (years)', 
        2: 'Income Distribution (%)',
        3: 'Monthly Income (Won)'
    }
    
    # Create summary with recent data (last few columns)
    recent_cols = df.columns[-5:]  # Last 5 time periods
    
    summary = pd.DataFrame()
    for idx, label in metric_labels.items():
        if idx < len(df):
            row_data = df.iloc[idx][recent_cols]
            summary[label] = row_data
    
    summary.index = recent_cols
    return summary.T  # Transpose for better readability

# Method 5: Time series format for visualization
def prepare_for_visualization(df):
    """Prepare data in format suitable for plotting"""
    
    # Convert to long format
    df_long = transform_to_long_format(df)
    
    # Add metric categories
    metric_mapping = {
        'household_members': 'Demographics',
        'household_head_age': 'Demographics', 
        'income_distribution': 'Financial',
        'income_amount': 'Financial'
    }
    
    # Clean time periods - extract year and quarter
    def parse_time_period(period_str):
        try:
            # Extract year and quarter from strings like '1990.1/4'
            if '/' in str(period_str):
                year_quarter = str(period_str).split('/')
                year = year_quarter[0]
                quarter = year_quarter[1] if len(year_quarter) > 1 else '1'
                return f"{year}-Q{quarter}"
            else:
                return str(period_str)
        except:
            return str(period_str)
    
    df_long['clean_period'] = df_long['time_period'].apply(parse_time_period)
    
    return df_long

combined_expenses_df = transform_to_long_format(combined_expenses)
combined_expenses_df.head(50)

                                               metric time_period value
0   By the item of monthly income & expenditure of...       index     0
1             The number of hosehold members (Person)       index     1
2                       Age of household's head (Age)       index     2
3                      Distribution of households (%)       index     3
4                                        Income (Won)       index     4
5                                Current income (Won)       index     5
6                        Wage and salary income (Won)       index     6
7                               Business income (Won)       index     7
8                               Property Income (Won)       index     8
9                               Transfer income (Won)       index     9
10                            Noncurrent income (Won)       index    10
11                                  Expenditure (Won)       index    11
12                      Consumption expenditure (Won)       index    12
13                      01.Food and soft drinks (Won)       index    13
14           02.Alcoholic beverages and tobacco (Won)       index    14
15                     03.Clothing and footwear (Won)       index    15
16  04.Housing, water, electricity, gas and other ...       index    16
17  05.Household equipment and housekeeping servic...       index    17
18                                    06.Health (Won)       index    18
19                            07.Transportation (Won)       index    19
20                             08.Communication (Won)       index    20
21                 09.Entertainment and culture (Won)       index    21
22                                 10.Education (Won)       index    22
23                    11.Restaurants and hotels (Won)       index    23
24    12.Other miscellaneous goods and services (Won)       index    24
25                 Non-consumption expenditures (Won)       index    25
26                            Disposable Income (Won)       index    26
27                                      Surplus (Won)       index    27
28                 Surplus over disposable income (%)       index    28
29                           Propensity to income (%)       index    29
30  By the item of monthly income & expenditure of...       index    30
31            The number of hosehold members (Person)       index    31
32                      Age of household's head (Age)       index    32
33                     Distribution of households (%)       index    33
34                                       Income (Won)       index    34
35                               Current income (Won)       index    35
36                       Wage and salary income (Won)       index    36
37                              Business income (Won)       index    37
38                              Property Income (Won)       index    38
39                              Transfer income (Won)       index    39
40                            Noncurrent income (Won)       index    40
41                                  Expenditure (Won)       index    41
42                      Consumption expenditure (Won)       index    42
43                      01.Food and soft drinks (Won)       index    43
44           02.Alcoholic beverages and tobacco (Won)       index    44
45                     03.Clothing and footwear (Won)       index    45
46  04.Housing, water, electricity, gas and other ...       index    46
47  05.Household equipment and housekeeping servic...       index    47
48                                    06.Health (Won)       index    48
49                            07.Transportation (Won)       index    49

In [381]:
combined_expenses_df.tail()

                                                metric time_period   value
20211               09.Entertainment and culture (Won)  2019.4/4.2       -
20212                               10.Education (Won)  2019.4/4.2       -
20213                  11.Restaurants and hotels (Won)  2019.4/4.2       -
20214  12.Other miscellaneous goods and services (Won)  2019.4/4.2       -
20215               Non-consumption expenditures (Won)  2019.4/4.2  773755

In [382]:
combined_expenses_df['time_period'].unique()

array(['index', '1990.1/4', '1990.1/4.1', '1990.1/4.2', '1990.2/4',
       '1990.2/4.1', '1990.2/4.2', '1990.3/4', '1990.3/4.1', '1990.3/4.2',
       '1990.4/4', '1990.4/4.1', '1990.4/4.2', '1991.1/4', '1991.1/4.1',
       '1991.1/4.2', '1991.2/4', '1991.2/4.1', '1991.2/4.2', '1991.3/4',
       '1991.3/4.1', '1991.3/4.2', '1991.4/4', '1991.4/4.1', '1991.4/4.2',
       '1992.1/4', '1992.1/4.1', '1992.1/4.2', '1992.2/4', '1992.2/4.1',
       '1992.2/4.2', '1992.3/4', '1992.3/4.1', '1992.3/4.2', '1992.4/4',
       '1992.4/4.1', '1992.4/4.2', '1993.1/4', '1993.1/4.1', '1993.1/4.2',
       '1993.2/4', '1993.2/4.1', '1993.2/4.2', '1993.3/4', '1993.3/4.1',
       '1993.3/4.2', '1993.4/4', '1993.4/4.1', '1993.4/4.2', '1994.1/4',
       '1994.1/4.1', '1994.1/4.2', '1994.2/4', '1994.2/4.1', '1994.2/4.2',
       '1994.3/4', '1994.3/4.1', '1994.3/4.2', '1994.4/4', '1994.4/4.1',
       '1994.4/4.2', '1995.1/4', '1995.1/4.1', '1995.1/4.2', '1995.2/4',
       '1995.2/4.1', '1995.2/4.2', '1995.3/4', '1995.3/4.1', '1995.3/4.2',
       '1995.4/4', '1995.4/4.1', '1995.4/4.2', '1996.1/4', '1996.1/4.1',
       '1996.1/4.2', '1996.2/4', '1996.2/4.1', '1996.2/4.2', '1996.3/4',
       '1996.3/4.1', '1996.3/4.2', '1996.4/4', '1996.4/4.1', '1996.4/4.2',
       '1997.1/4', '1997.1/4.1', '1997.1/4.2', '1997.2/4', '1997.2/4.1',
       '1997.2/4.2', '1997.3/4', '1997.3/4.1', '1997.3/4.2', '1997.4/4',
       '1997.4/4.1', '1997.4/4.2', '1998.1/4', '1998.1/4.1', '1998.1/4.2',
       '1998.2/4', '1998.2/4.1', '1998.2/4.2', '1998.3/4', '1998.3/4.1',
       '1998.3/4.2', '1998.4/4', '1998.4/4.1', '1998.4/4.2', '1999.1/4',
       '1999.1/4.1', '1999.1/4.2', '1999.2/4', '1999.2/4.1', '1999.2/4.2',
       '1999.3/4', '1999.3/4.1', '1999.3/4.2', '1999.4/4', '1999.4/4.1',
       '1999.4/4.2', '2000.1/4', '2000.1/4.1', '2000.1/4.2', '2000.2/4',
       '2000.2/4.1', '2000.2/4.2', '2000.3/4', '2000.3/4.1', '2000.3/4.2',
       '2000.4/4', '2000.4/4.1', '2000.4/4.2', '2001.1/4', '2001.1/4.1',
       '2001.1/4.2', '2001.2/4', '2001.2/4.1', '2001.2/4.2', '2001.3/4',
       '2001.3/4.1', '2001.3/4.2', '2001.4/4', '2001.4/4.1', '2001.4/4.2',
       '2002.1/4', '2002.1/4.1', '2002.1/4.2', '2002.2/4', '2002.2/4.1',
       '2002.2/4.2', '2002.3/4', '2002.3/4.1', '2002.3/4.2', '2002.4/4',
       '2002.4/4.1', '2002.4/4.2', '2003.1/4', '2003.1/4.1', '2003.1/4.2',
       '2003.2/4', '2003.2/4.1', '2003.2/4.2', '2003.3/4', '2003.3/4.1',
       '2003.3/4.2', '2003.4/4', '2003.4/4.1', '2003.4/4.2', '2004.1/4',
       '2004.1/4.1', '2004.1/4.2', '2004.2/4', '2004.2/4.1', '2004.2/4.2',
       '2004.3/4', '2004.3/4.1', '2004.3/4.2', '2004.4/4', '2004.4/4.1',
       '2004.4/4.2', '2005.1/4', '2005.1/4.1', '2005.1/4.2', '2005.2/4',
       '2005.2/4.1', '2005.2/4.2', '2005.3/4', '2005.3/4.1', '2005.3/4.2',
       '2005.4/4', '2005.4/4.1', '2005.4/4.2', '2006.1/4', '2006.1/4.1',
       '2006.1/4.2', '2006.2/4', '2006.2/4.1', '2006.2/4.2', '2006.3/4',
       '2006.3/4.1', '2006.3/4.2', '2006.4/4', '2006.4/4.1', '2006.4/4.2',
       '2007.1/4', '2007.1/4.1', '2007.1/4.2', '2007.2/4', '2007.2/4.1',
       '2007.2/4.2', '2007.3/4', '2007.3/4.1', '2007.3/4.2', '2007.4/4',
       '2007.4/4.1', '2007.4/4.2', '2008.1/4', '2008.1/4.1', '2008.1/4.2',
       '2008.2/4', '2008.2/4.1', '2008.2/4.2', '2008.3/4', '2008.3/4.1',
       '2008.3/4.2', '2008.4/4', '2008.4/4.1', '2008.4/4.2', '2009.1/4',
       '2009.1/4.1', '2009.1/4.2', '2009.2/4', '2009.2/4.1', '2009.2/4.2',
       '2009.3/4', '2009.3/4.1', '2009.3/4.2', '2009.4/4', '2009.4/4.1',
       '2009.4/4.2', '2010.1/4', '2010.1/4.1', '2010.1/4.2', '2010.2/4',
       '2010.2/4.1', '2010.2/4.2', '2010.3/4', '2010.3/4.1', '2010.3/4.2',
       '2010.4/4', '2010.4/4.1', '2010.4/4.2', '2011.1/4', '2011.1/4.1',
       '2011.1/4.2', '2011.2/4', '2011.2/4.1', '2011.2/4.2', '2011.3/4',
       '2011.3/4.1', '2011.3/4.2', '2011.4/4', '2011.4/4.1', '2011.4/4.2',
       '2012.1/4', '2012.1/4.1', '2012.1/4.2', '2012.2/4', '2012.2/4.1',
       '2012.2/4.2', '2012.3/4', '2012.3/4.1', '2012.3/4.2', '2012.4/4',
       '2012.4/4.1', '2012.4/4.2', '2013.1/4', '2013.1/4.1', '2013.1/4.2',
       '2013.2/4', '2013.2/4.1', '2013.2/4.2', '2013.3/4', '2013.3/4.1',
       '2013.3/4.2', '2013.4/4', '2013.4/4.1', '2013.4/4.2', '2014.1/4',
       '2014.1/4.1', '2014.1/4.2', '2014.2/4', '2014.2/4.1', '2014.2/4.2',
       '2014.3/4', '2014.3/4.1', '2014.3/4.2', '2014.4/4', '2014.4/4.1',
       '2014.4/4.2', '2015.1/4', '2015.1/4.1', '2015.1/4.2', '2015.2/4',
       '2015.2/4.1', '2015.2/4.2', '2015.3/4', '2015.3/4.1', '2015.3/4.2',
       '2015.4/4', '2015.4/4.1', '2015.4/4.2', '2016.1/4', '2016.1/4.1',
       '2016.1/4.2', '2016.2/4', '2016.2/4.1', '2016.2/4.2', '2016.3/4',
       '2016.3/4.1', '2016.3/4.2', '2016.4/4', '2016.4/4.1', '2016.4/4.2',
       '2017.1/4', '2017.1/4.1', '2017.1/4.2', '2017.2/4', '2017.2/4.1',
       '2017.2/4.2', '2017.3/4', '2017.3/4.1', '2017.3/4.2', '2017.4/4',
       '2017.4/4.1', '2017.4/4.2', '2018.1/4', '2018.1/4.1', '2018.1/4.2',
       '2018.2/4', '2018.2/4.1', '2018.2/4.2', '2018.3/4', '2018.3/4.1',
       '2018.3/4.2', '2018.4/4', '2018.4/4.1', '2018.4/4.2', '2019.1/4',
       '2019.1/4.1', '2019.1/4.2', '2019.2/4', '2019.2/4.1', '2019.2/4.2',
       '2019.3/4', '2019.3/4.1', '2019.3/4.2', '2019.4/4', '2019.4/4.1',
       '2019.4/4.2'], dtype=object)

In [383]:
# Inspect unique values in the 'metric' column
combined_expenses_df['metric'].unique()

array(['By the item of monthly income & expenditure of household',
       'The number of hosehold members (Person)',
       "Age of household's head (Age)", 'Distribution of households (%)',
       'Income (Won)', 'Current income (Won)',
       'Wage and salary income (Won)', 'Business income (Won)',
       'Property Income (Won)', 'Transfer income (Won)',
       'Noncurrent income (Won)', 'Expenditure (Won)',
       'Consumption expenditure (Won)', '01.Food and soft drinks (Won)',
       '02.Alcoholic beverages and tobacco (Won)',
       '03.Clothing and footwear (Won)',
       '04.Housing, water, electricity, gas and other fuels (Won)',
       '05.Household equipment and housekeeping services (Won)',
       '06.Health (Won)', '07.Transportation (Won)',
       '08.Communication (Won)', '09.Entertainment and culture (Won)',
       '10.Education (Won)', '11.Restaurants and hotels (Won)',
       '12.Other miscellaneous goods and services (Won)',
       'Non-consumption expenditures (Won)', 'Disposable Income (Won)',
       'Surplus (Won)', 'Surplus over disposable income (%)',
       'Propensity to income (%)'], dtype=object)

In [384]:
# Adjust the filter condition based on actual values in the 'metric' column
combined_expenses_df = combined_expenses_df[combined_expenses_df['time_period'] != 'index']
combined_expenses_df = combined_expenses_df[combined_expenses_df['metric'] == 'Income (Won)']  # Fixed filter value

In [385]:
# Display the DataFrame to verify the fix
combined_expenses_df.head(10)

           metric time_period   value
60   Income (Won)    1990.1/4  880499
90   Income (Won)    1990.1/4     NaN
116  Income (Won)  1990.1/4.1  890099
146  Income (Won)  1990.1/4.1     NaN
172  Income (Won)  1990.1/4.2  860860
202  Income (Won)  1990.1/4.2     NaN
228  Income (Won)    1990.2/4  893567
258  Income (Won)    1990.2/4     NaN
284  Income (Won)  1990.2/4.1  893907
314  Income (Won)  1990.2/4.1     NaN

In [386]:
combined_expenses_df.tail()

             metric time_period    value
20082  Income (Won)    2019.4/4  4771921
20108  Income (Won)  2019.4/4.1  5494686
20138  Income (Won)  2019.4/4.1  5411583
20164  Income (Won)  2019.4/4.2  3931339
20194  Income (Won)  2019.4/4.2  3815300

In [387]:
# drop NaN values if value is NaN
combined_expenses_df = combined_expenses_df.dropna(subset=['value'])
combined_expenses_df.head(10)

           metric time_period    value
60   Income (Won)    1990.1/4   880499
116  Income (Won)  1990.1/4.1   890099
172  Income (Won)  1990.1/4.2   860860
228  Income (Won)    1990.2/4   893567
284  Income (Won)  1990.2/4.1   893907
340  Income (Won)  1990.2/4.2   892856
396  Income (Won)    1990.3/4   955067
452  Income (Won)  1990.3/4.1   978042
508  Income (Won)  1990.3/4.2   906743
564  Income (Won)    1990.4/4  1023397

In [388]:
# Create a custom function to parse the quarter format like '1990.1/4'
def parse_quarter_format(period_str):
    try:
        if isinstance(period_str, str) and '/' in period_str:
            # Split by '.' first to get year and remaining part
            parts = period_str.split('.')
            year = int(parts[0])
            
            # Split the second part by '/' to get quarter
            if len(parts) > 1 and '/' in parts[1]:
                quarter_part = parts[1].split('/')
                quarter = int(quarter_part[0])
                
                # Convert quarter to month (Q1->1, Q2->4, Q3->7, Q4->10)
                month = 1 + (quarter - 1) * 3
                
                # Return a datetime object for the start of the quarter
                return pd.Timestamp(year=year, month=month, day=1)
        
        # Try standard parsing for other formats
        return pd.to_datetime(period_str, errors='coerce')
    except:
        # Return NaT for parsing failures
        return pd.NaT

# Apply the custom parser to the time_period column
combined_expenses_df['date'] = combined_expenses_df['time_period'].apply(parse_quarter_format)

# Extract year from the date
combined_expenses_df['year'] = combined_expenses_df['date'].dt.year

# Extract quarter from the date (1-4)
combined_expenses_df['quarter'] = combined_expenses_df['date'].dt.month.apply(lambda x: (x-1)//3 + 1 if pd.notnull(x) else None)

# Display the result
combined_expenses_df.head()

           metric time_period   value       date  year  quarter
60   Income (Won)    1990.1/4  880499 1990-01-01  1990        1
116  Income (Won)  1990.1/4.1  890099 1990-01-01  1990        1
172  Income (Won)  1990.1/4.2  860860 1990-01-01  1990        1
228  Income (Won)    1990.2/4  893567 1990-04-01  1990        2
284  Income (Won)  1990.2/4.1  893907 1990-04-01  1990        2

In [389]:
combined_expenses_df.tail()

             metric time_period    value       date  year  quarter
20082  Income (Won)    2019.4/4  4771921 2019-10-01  2019        4
20108  Income (Won)  2019.4/4.1  5494686 2019-10-01  2019        4
20138  Income (Won)  2019.4/4.1  5411583 2019-10-01  2019        4
20164  Income (Won)  2019.4/4.2  3931339 2019-10-01  2019        4
20194  Income (Won)  2019.4/4.2  3815300 2019-10-01  2019        4

In [390]:
#save the cleaned DataFrame to CSV
combined_expenses_df.to_csv('/home/unsmartboy/Documents/housing_forecast/processed_data/expenses_by_year.csv', index=False)

In [391]:
housing_price_index_by_housingtype.head()

,Region,By Housing Type,1986.01,1986.02,1986.03,1986.04,1986.05,1986.06,1986.07,1986.08,...,2012.03,2012.04,2012.05,2012.06,2012.07,2012.08,2012.09,2012.10,2012.11,2012.12
0,Whole Country,Total,40.2,40.2,40.3,40.0,39.8,39.6,39.5,39.5,...,102.9,103.0,103.1,103.0,102.9,102.8,102.7,102.6,102.5,102.4
1,Whole Country,Apartments,24.7,24.7,24.7,24.5,24.4,24.2,24.1,24.0,...,103.9,104.0,104.1,104.0,103.9,103.7,103.5,103.3,103.2,103.1
2,Whole Country,single,69.4,69.4,69.6,69.1,68.9,68.7,68.6,68.6,...,101.6,101.7,101.9,101.9,102.0,102.0,102.0,102.1,102.1,102.1
3,Whole Country,Row Houses,47.0,46.8,46.6,46.6,45.6,45.5,45.4,45.4,...,101.2,101.2,101.2,101.2,101.0,101.0,100.9,100.8,100.8,100.7
4,Seoul,Total,35.6,35.6,35.6,35.4,35.1,34.8,34.7,34.7,...,99.3,99.1,98.9,98.7,98.3,98.0,97.6,97.2,97.0,96.7

In [392]:
housing_price_index_by_housingtype.tail()

,Region,By Housing Type,1986.01,1986.02,1986.03,1986.04,1986.05,1986.06,1986.07,1986.08,...,2012.03,2012.04,2012.05,2012.06,2012.07,2012.08,2012.09,2012.10,2012.11,2012.12
51,Non Metropolitan Area,Row Houses,-,-,-,-,-,-,-,-,...,104.9,105.2,105.8,106.2,106.6,106.7,107.1,107.1,107.2,107.4
52,5 Metropolitan Cities,Total,-,-,-,-,-,-,-,-,...,107.1,107.6,108.0,108.1,108.3,108.3,108.4,108.7,108.8,108.9
53,5 Metropolitan Cities,Apartments,-,-,-,-,-,-,-,-,...,108.9,109.5,109.8,109.9,110.0,110.1,110.2,110.4,110.6,110.6
54,5 Metropolitan Cities,single,-,-,-,-,-,-,-,-,...,102.5,102.8,103.1,103.3,103.5,103.6,103.7,103.9,104.0,104.1
55,5 Metropolitan Cities,Row Houses,-,-,-,-,-,-,-,-,...,106.2,106.6,107.1,107.4,107.8,107.9,108.1,108.4,108.5,108.7

In [393]:
# Identify the columns that are dates (they look like years in format YYYY.MM)
date_columns = [col for col in housing_price_index_by_housingtype.columns if col.replace('.', '').isdigit()]

# Identify the non-date columns (Region and By Housing Type)
id_columns = ['Region', 'By Housing Type']

# Melt the DataFrame
housing_price_index_by_housingtype = housing_price_index_by_housingtype.melt(
    id_vars=id_columns,
    value_vars=date_columns,
    var_name='Date',
    value_name='Price_Index'
)

# Convert the Date column to datetime format
housing_price_index_by_housingtype['Date'] = pd.to_datetime(housing_price_index_by_housingtype['Date'], format='%Y.%m')

# Sort by Region, Housing Type, and Date for better organization
housing_price_index_by_housingtype = housing_price_index_by_housingtype.sort_values(['Region', 'By Housing Type', 'Date'])

# Remove rows with NaN values if needed
housing_price_index_by_housingtype = housing_price_index_by_housingtype.dropna(subset=['Price_Index'])

# Reset index
housing_price_index_by_housingtype = housing_price_index_by_housingtype.reset_index(drop=True)

print(housing_price_index_by_housingtype.head(10))

                  Region By Housing Type       Date Price_Index
0  5 Metropolitan Cities      Apartments 1986-01-01           -
1  5 Metropolitan Cities      Apartments 1986-02-01           -
2  5 Metropolitan Cities      Apartments 1986-03-01           -
3  5 Metropolitan Cities      Apartments 1986-04-01           -
4  5 Metropolitan Cities      Apartments 1986-05-01           -
5  5 Metropolitan Cities      Apartments 1986-06-01           -
6  5 Metropolitan Cities      Apartments 1986-07-01           -
7  5 Metropolitan Cities      Apartments 1986-08-01           -
8  5 Metropolitan Cities      Apartments 1986-09-01           -
9  5 Metropolitan Cities      Apartments 1986-10-01           -

In [394]:
housing_price_index_by_housingtype.tail()

              Region By Housing Type       Date Price_Index
18139  Whole Country          single 2012-08-01       102.0
18140  Whole Country          single 2012-09-01       102.0
18141  Whole Country          single 2012-10-01       102.1
18142  Whole Country          single 2012-11-01       102.1
18143  Whole Country          single 2012-12-01       102.1

In [395]:
housing_price_index_by_housingtype.describe()

                                Date
count                          18144
mean   1999-06-16 19:51:06.666666496
min              1986-01-01 00:00:00
25%              1992-09-23 12:00:00
50%              1999-06-16 00:00:00
75%              2006-03-08 18:00:00
max              2012-12-01 00:00:00

In [396]:
housing_price_index_by_housingtype.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18144 entries, 0 to 18143
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Region           18144 non-null  object
 1   By Housing Type  18144 non-null  object
 2   Date             18144 non-null  datetime64[ns]
 3   Price_Index      18144 non-null  object
dtypes: datetime64[ns](1), object(3)
memory usage: 567.1+ KB

In [397]:
housing_price_index_by_housingtype['By Housing Type'].value_counts()

By Housing Type
Apartments    4536
Row Houses    4536
Total         4536
single        4536
Name: count, dtype: int64

In [398]:
housing_price_index_by_housingtype['Region'].value_counts()

Region
5 Metropolitan Cities      1296
6 Large Cities             1296
Chungcheongbuk-do          1296
Chungcheongnam-do          1296
Gangwon-do                 1296
Gyeonggi-do                1296
Gyeongsangbuk-do           1296
Gyeongsangnam-do           1296
Jeollabuk-do               1296
Jeollanam-do               1296
Non Metropolitan Area      1296
Seoul                      1296
Seoul Metropolitan Area    1296
Whole Country              1296
Name: count, dtype: int64

In [399]:
housing_price_index_by_housingtype.to_csv('/home/unsmartboy/Documents/housing_forecast/processed_data/housing_price_index_by_housingtype.csv', index=False)

In [400]:
number_house_owners_byage.head()

,By residential area(1),2015,2015.1,2015.2,2016,2016.1,2016.2,2017,2017.1,2017.2,...,2020.2,2021,2021.1,2021.2,2022,2022.1,2022.2,2023,2023.1,2023.2
0,By residential area(1),Total households (ordinary households),house ownership households,Non ownership households,Total households (ordinary households),house ownership households,Non ownership households,Total households (ordinary households),house ownership households,Non ownership households,...,Non ownership households,Total households (ordinary households),house ownership households,Non ownership households,Total households (ordinary households),house ownership households,Non ownership households,Total households (ordinary households),house ownership households,Non ownership households
1,Whole country,19111030,10698686,8412344,19367696,10743492,8624204,19673875,11000007,8673868,...,9196539,21448463,12062871,9385592,21773507,12232407,9541100,22073158,12454684,9618474
2,Seoul,3784490,1875295,1909195,3784705,1864059,1920646,3813260,1875189,1938071,...,2054216,4046799,1974544,2072255,4098818,1991345,2107473,4141659,1998410,2143249
3,Busan,1335900,786367,549533,1344170,783542,560628,1354401,791489,562912,...,595657,1431365,822769,608596,1447825,831691,616134,1462404,845691,616713
4,Daegu,928528,533011,395517,935753,537709,398044,948030,550374,397656,...,416192,1000931,579620,421311,1010834,586337,424497,1033238,603118,430120

In [401]:
number_house_owners_byage.tail()

,By residential area(1),2015,2015.1,2015.2,2016,2016.1,2016.2,2017,2017.1,2017.2,...,2020.2,2021,2021.1,2021.2,2022,2022.1,2022.2,2023,2023.1,2023.2
14,Jeollabuk-do,717311,421666,295645,724678,415291,309387,728871,427522,301349,...,306844,772471,458116,314355,777680,456701,320979,786775,464828,321947
15,Jeollanam-do,720612,431275,289337,727197,421262,305935,733757,435332,298425,...,297055,777358,477123,300235,784645,481045,303600,793249,489842,303407
16,Gyeongsangbuk-do,1062724,635608,427116,1076581,632790,443791,1087807,652416,435391,...,442830,1156645,707840,448805,1166306,711656,454650,1166594,712910,453684
17,Gyeongsangnam-do,1258487,769925,488562,1273523,773636,499887,1292998,800655,492343,...,499881,1378982,868473,510509,1392608,875525,517083,1404476,883584,520892
18,Jeju,220369,123364,97005,229337,126245,103092,240215,132246,107969,...,118755,271162,149416,121746,276225,153459,122766,278315,156017,122298

In [402]:
import pandas as pd

# Assuming your DataFrame is called 'number_house_owners_byage'
df = number_house_owners_byage

# First, let's identify the pattern of columns
# It looks like: Year, Year.1, Year.2 (for half-years), with alternating household types

# Step 1: Identify year columns (numeric-like columns)
year_columns = []
for col in df.columns:
    if col not in ['By residential area(1)']:
        try:
            # Check if it's a year or year.period format
            float(col.replace('.', ''))
            year_columns.append(col)
        except:
            pass

# Step 2: Create a mapping of columns to their household type
# Looking at the pattern, it alternates between different household types
household_types = []
for i, col in enumerate(year_columns):
    if i % 3 == 0:
        household_types.append('Total households (ordinary households)')
    elif i % 3 == 1:
        household_types.append('house households')
    else:
        household_types.append('Non ownership households')

# Step 3: Reshape the data
reshaped_data = []

for idx, row in df.iterrows():
    area = row['By residential area(1)']
    
    for i, col in enumerate(year_columns):
        if pd.notna(row[col]) and row[col] != '-':
            reshaped_data.append({
                'Area': area,
                'Period': col,
                'Household_Type': household_types[i],
                'Count': row[col]
            })

# Create new DataFrame
df_long = pd.DataFrame(reshaped_data)

# Convert Period to datetime if needed
# For years without decimals, assume it's the full year
df_long['Year'] = df_long['Period'].apply(lambda x: float(x.split('.')[0]))
df_long['Sub_Period'] = df_long['Period'].apply(lambda x: int(x.split('.')[1]) if '.' in str(x) else 0)

# Sort the data
df_long = df_long.sort_values(['Area', 'Year', 'Sub_Period', 'Household_Type'])

print(df_long.head(20))

      Area  Period                          Household_Type    Count    Year  \
81   Busan    2015  Total households (ordinary households)  1335900  2015.0
82   Busan  2015.1                        house households   786367  2015.0
83   Busan  2015.2                Non ownership households   549533  2015.0
84   Busan    2016  Total households (ordinary households)  1344170  2016.0
85   Busan  2016.1                        house households   783542  2016.0
86   Busan  2016.2                Non ownership households   560628  2016.0
87   Busan    2017  Total households (ordinary households)  1354401  2017.0
88   Busan  2017.1                        house households   791489  2017.0
89   Busan  2017.2                Non ownership households   562912  2017.0
90   Busan    2018  Total households (ordinary households)  1363608  2018.0
91   Busan  2018.1                        house households   796271  2018.0
92   Busan  2018.2                Non ownership households   567337  2018.0
93   Busan    2019  Total households (ordinary households)  1377030  2019.0
94   Busan  2019.1                        house households   799696  2019.0
95   Busan  2019.2                Non ownership households   577334  2019.0
96   Busan    2020  Total households (ordinary households)  1405037  2020.0
97   Busan  2020.1                        house households   809380  2020.0
98   Busan  2020.2                Non ownership households   595657  2020.0
99   Busan    2021  Total households (ordinary households)  1431365  2021.0
100  Busan  2021.1                        house households   822769  2021.0

     Sub_Period
81            0
82            1
83            2
84            0
85            1
86            2
87            0
88            1
89            2
90            0
91            1
92            2
93            0
94            1
95            2
96            0
97            1
98            2
99            0
100           1

In [403]:
df_long.head(10)

,Area,Period,Household_Type,Count,Year,Sub_Period
81,Busan,2015,Total households (ordinary households),1335900,2015.0,0
82,Busan,2015.1,house households,786367,2015.0,1
83,Busan,2015.2,Non ownership households,549533,2015.0,2
84,Busan,2016,Total households (ordinary households),1344170,2016.0,0
85,Busan,2016.1,house households,783542,2016.0,1
86,Busan,2016.2,Non ownership households,560628,2016.0,2
87,Busan,2017,Total households (ordinary households),1354401,2017.0,0
88,Busan,2017.1,house households,791489,2017.0,1
89,Busan,2017.2,Non ownership households,562912,2017.0,2
90,Busan,2018,Total households (ordinary households),1363608,2018.0,0

In [404]:
df_long.tail(10)

,Area,Period,Household_Type,Count,Year,Sub_Period
44,Whole country,2020.2,Non ownership households,9196539,2020.0,2
45,Whole country,2021,Total households (ordinary households),21448463,2021.0,0
46,Whole country,2021.1,house households,12062871,2021.0,1
47,Whole country,2021.2,Non ownership households,9385592,2021.0,2
48,Whole country,2022,Total households (ordinary households),21773507,2022.0,0
49,Whole country,2022.1,house households,12232407,2022.0,1
50,Whole country,2022.2,Non ownership households,9541100,2022.0,2
51,Whole country,2023,Total households (ordinary households),22073158,2023.0,0
52,Whole country,2023.1,house households,12454684,2023.0,1
53,Whole country,2023.2,Non ownership households,9618474,2023.0,2

In [405]:
df_long['Year'] = pd.to_datetime(df_long['Year'], format='%Y', errors='coerce')

In [406]:
# sort by year
df_long = df_long.sort_values(by='Year')
df_long.head()

,Area,Period,Household_Type,Count,Year,Sub_Period
81,Busan,2015,Total households (ordinary households),1335900,2015-01-01,0
110,Daegu,2015.2,Non ownership households,395517,2015-01-01,2
109,Daegu,2015.1,house households,533011,2015-01-01,1
55,Seoul,2015.1,house households,1875295,2015-01-01,1
243,Sejong,2015,Total households (ordinary households),75219,2015-01-01,0

In [407]:
df_long.tail(3)

,Area,Period,Household_Type,Count,Year,Sub_Period
510,Jeju,2023,Total households (ordinary households),278315,2023-01-01,0
512,Jeju,2023.2,Non ownership households,122298,2023-01-01,2
53,Whole country,2023.2,Non ownership households,9618474,2023-01-01,2

In [408]:
df_long.to_csv('/home/unsmartboy/Documents/housing_forecast/processed_data/number_house_owners_byage.csv', index=False)

In [409]:
house_ownership_nonownership.head()

,By residential area(1),2015,2015.1,2015.2,2016,2016.1,2016.2,2017,2017.1,2017.2,...,2020.2,2021,2021.1,2021.2,2022,2022.1,2022.2,2023,2023.1,2023.2
0,By residential area(1),Total households (ordinary households),house ownership households,Non ownership households,Total households (ordinary households),house ownership households,Non ownership households,Total households (ordinary households),house ownership households,Non ownership households,...,Non ownership households,Total households (ordinary households),house ownership households,Non ownership households,Total households (ordinary households),house ownership households,Non ownership households,Total households (ordinary households),house ownership households,Non ownership households
1,Whole country,19111030,10698686,8412344,19367696,10743492,8624204,19673875,11000007,8673868,...,9196539,21448463,12062871,9385592,21773507,12232407,9541100,22073158,12454684,9618474
2,Seoul,3784490,1875295,1909195,3784705,1864059,1920646,3813260,1875189,1938071,...,2054216,4046799,1974544,2072255,4098818,1991345,2107473,4141659,1998410,2143249
3,Busan,1335900,786367,549533,1344170,783542,560628,1354401,791489,562912,...,595657,1431365,822769,608596,1447825,831691,616134,1462404,845691,616713
4,Daegu,928528,533011,395517,935753,537709,398044,948030,550374,397656,...,416192,1000931,579620,421311,1010834,586337,424497,1033238,603118,430120

In [410]:
house_ownership_nonownership.tail()

,By residential area(1),2015,2015.1,2015.2,2016,2016.1,2016.2,2017,2017.1,2017.2,...,2020.2,2021,2021.1,2021.2,2022,2022.1,2022.2,2023,2023.1,2023.2
14,Jeollabuk-do,717311,421666,295645,724678,415291,309387,728871,427522,301349,...,306844,772471,458116,314355,777680,456701,320979,786775,464828,321947
15,Jeollanam-do,720612,431275,289337,727197,421262,305935,733757,435332,298425,...,297055,777358,477123,300235,784645,481045,303600,793249,489842,303407
16,Gyeongsangbuk-do,1062724,635608,427116,1076581,632790,443791,1087807,652416,435391,...,442830,1156645,707840,448805,1166306,711656,454650,1166594,712910,453684
17,Gyeongsangnam-do,1258487,769925,488562,1273523,773636,499887,1292998,800655,492343,...,499881,1378982,868473,510509,1392608,875525,517083,1404476,883584,520892
18,Jeju,220369,123364,97005,229337,126245,103092,240215,132246,107969,...,118755,271162,149416,121746,276225,153459,122766,278315,156017,122298

In [411]:

def transform_house_ownership_data(df):
    """
    Transform house ownership data from wide format to long format.
    
    Parameters:
    df (pandas.DataFrame): Input dataframe with years as columns
    
    Returns:
    pandas.DataFrame: Transformed dataframe with years in a single column
    """
    
    # Step 1: Identify the ID column(s) - the first column contains area names
    id_vars = ['By residential area(1)']
    
    # Step 2: Get all year columns (all columns except the first one)
    year_columns = [col for col in df.columns if col != 'By residential area(1)']
    
    # Step 3: Melt the dataframe to long format
    df_long = pd.melt(df, 
                      id_vars=id_vars, 
                      value_vars=year_columns,
                      var_name='Year_Period', 
                      value_name='Value')
    
    # Step 4: Parse the Year_Period column to separate year and sub-period
    # Some columns are just years (e.g., '2015'), others have periods (e.g., '2015.1', '2015.2')
    df_long['Year'] = df_long['Year_Period'].str.split('.').str[0]
    df_long['Period'] = df_long['Year_Period'].str.split('.').str[1]
    
    # Fill NaN in Period column with 'Total' for entries without sub-periods
    df_long['Period'] = df_long['Period'].fillna('Total')
    
    # Step 5: Map period values to meaningful names
    period_mapping = {
        'Total': 'Total households',
        '1': 'House ownership households',
        '2': 'Non-ownership households'
    }
    df_long['Household_Type'] = df_long['Period'].map(period_mapping)
    
    # Step 6: Rename columns for clarity
    df_long = df_long.rename(columns={
        'By residential area(1)': 'Residential_Area',
        'Value': 'Count'
    })
    
    # Step 7: Reorder columns and sort
    df_long = df_long[['Residential_Area', 'Year', 'Household_Type', 'Count']]
    df_long = df_long.sort_values(['Residential_Area', 'Year', 'Household_Type'])
    
    # Step 8: Convert Year to integer and Count to integer (handling any potential NaN values)
    df_long['Year'] = pd.to_numeric(df_long['Year'], errors='coerce')
    df_long['Count'] = pd.to_numeric(df_long['Count'], errors='coerce')
    
    # Reset index
    df_long = df_long.reset_index(drop=True)
    
    return df_long
# Transform the house ownership data
transformed_house_ownership = transform_house_ownership_data(house_ownership_nonownership)

In [412]:
transformed_house_ownership.head(10)

  Residential_Area  Year              Household_Type      Count
0            Busan  2015  House ownership households   786367.0
1            Busan  2015    Non-ownership households   549533.0
2            Busan  2015            Total households  1335900.0
3            Busan  2016  House ownership households   783542.0
4            Busan  2016    Non-ownership households   560628.0
5            Busan  2016            Total households  1344170.0
6            Busan  2017  House ownership households   791489.0
7            Busan  2017    Non-ownership households   562912.0
8            Busan  2017            Total households  1354401.0
9            Busan  2018  House ownership households   796271.0

In [413]:
transformed_house_ownership.tail(3)

    Residential_Area  Year              Household_Type       Count
510    Whole country  2023  House ownership households  12454684.0
511    Whole country  2023    Non-ownership households   9618474.0
512    Whole country  2023            Total households  22073158.0

In [414]:
transformed_house_ownership.isnull().sum()

Residential_Area     0
Year                 0
Household_Type       0
Count               27
dtype: int64

In [415]:
transformed_house_ownership.to_csv('/home/unsmartboy/Documents/housing_forecast/processed_data/house_ownership_nonownership.csv', index=False)

In [416]:
number_houses_per1000.head()

,Classification(1),1995,1995.1,1995.2,2000,2000.1,2000.2,2005,2005.1,2005.2,...,2022.2,2022.3,2022.4,2022.5,2023,2023.1,2023.2,2023.3,2023.4,2023.5
0,Classification(1),Population figures,The number of houses,The number of houses per 1000 people,Population figures,The number of houses,The number of houses per 1000 people,Population figures,The number of houses,The number of houses per 1000 people,...,The number of houses per 1000 people,Number of population,,,Population figures,The number of houses,The number of houses per 1000 people,Number of population,,
1,Whoe Country,44608.7,9570.4,214.5,46136.1,11472.4,248.7,47279.0,15622.5,330.4,...,0.0,51692.3,22236.9,430.2,0.0,0.0,0.0,51774.5,22623.9,437.0
2,Capital Area,20189.1,3859.4,191.2,21354.5,4731.2,221.6,22766.9,7165.0,314.7,...,0.0,26124.4,10357.8,396.5,0.0,0.0,0.0,26225.8,10573.7,403.2
3,Seoul,10231.2,1727.9,168.9,9895.2,1973.2,199.4,9820.2,3102.2,315.9,...,0.0,9417.5,3839.8,407.7,0.0,0.0,0.0,9384.5,3878.5,413.3
4,Busan,3814.3,677.0,177.5,3662.9,830.2,226.7,3523.6,1161.0,329.5,...,0.0,3295.8,1485.6,450.8,0.0,0.0,0.0,3279.6,1505.4,459.0

In [417]:
number_houses_per1000.tail()

,Classification(1),1995,1995.1,1995.2,2000,2000.1,2000.2,2005,2005.1,2005.2,...,2022.2,2022.3,2022.4,2022.5,2023,2023.1,2023.2,2023.3,2023.4,2023.5
15,Jeollabuk-do,1902.0,496.1,260.8,1890.7,568.6,300.7,1784.0,638.4,357.9,...,0.0,1774.3,849.1,478.5,0.0,0.0,0.0,1768.5,859.3,485.9
16,Jeollanam-do,2066.8,606.4,293.4,1996.5,647.0,324.1,1819.8,692.3,380.4,...,0.0,1771.4,881.7,497.7,0.0,0.0,0.0,1776.7,893.0,502.6
17,Gyeongsangbuk-do,2676.3,723.2,270.2,2724.9,824.7,302.7,2607.6,965.4,370.2,...,0.0,2620.4,1320.7,504.0,0.0,0.0,0.0,2589.9,1319.7,509.6
18,Gyeongsangnam-do,3845.6,897.8,233.5,2978.5,822.3,276.1,3056.4,1062.1,347.5,...,0.0,3280.8,1522.6,464.1,0.0,0.0,0.0,3271.2,1532.2,468.4
19,Jeju,505.4,114.2,226.0,513.3,127.6,248.5,531.9,172.0,323.4,...,0.0,676.4,288.0,425.8,0.0,0.0,0.0,676.8,293.2,433.2

In [418]:
def transform_houses_per_1000_data(df):
    """
    Transform houses per 1000 people data from wide format to long format.
    This handles the complex structure where columns alternate between:
    - Population figures
    - The number of houses  
    - The number of houses per 1000 people
    
    Parameters:
    df (pandas.DataFrame): Input dataframe with years as columns
    
    Returns:
    pandas.DataFrame: Transformed dataframe with years in a single column
    """
    
    # Step 1: Identify the ID column
    id_col = 'Classification(1)'
    
    # Step 2: Get all columns except the ID column
    value_columns = [col for col in df.columns if col != id_col]
    
    # Step 3: Identify the pattern of columns
    # The pattern repeats every 3 columns: Year, Year.1, Year.2
    # Year = Population figures
    # Year.1 = The number of houses
    # Year.2 = The number of houses per 1000 people
    
    # Create lists to store data for each metric type
    population_data = []
    houses_data = []
    houses_per_1000_data = []
    
    # Process columns in groups of 3
    i = 0
    while i < len(value_columns):
        if i + 2 < len(value_columns):
            # Get the base year from the first column in the group
            year = value_columns[i].split('.')[0]
            
            # Population figures (Year)
            population_data.append({
                'column': value_columns[i],
                'year': year,
                'metric': 'Population figures'
            })
            
            # The number of houses (Year.1)
            houses_data.append({
                'column': value_columns[i+1],
                'year': year,
                'metric': 'The number of houses'
            })
            
            # The number of houses per 1000 people (Year.2)
            houses_per_1000_data.append({
                'column': value_columns[i+2],
                'year': year,
                'metric': 'Houses per 1000 people'
            })
            
            i += 3
        else:
            # Handle any remaining columns
            col = value_columns[i]
            year = col.split('.')[0]
            
            # Determine metric type based on column suffix
            if '.1' in col:
                houses_data.append({
                    'column': col,
                    'year': year,
                    'metric': 'The number of houses'
                })
            elif '.2' in col:
                houses_per_1000_data.append({
                    'column': col,
                    'year': year,
                    'metric': 'Houses per 1000 people'
                })
            else:
                population_data.append({
                    'column': col,
                    'year': year,
                    'metric': 'Population figures'
                })
            i += 1
    
    # Step 4: Melt the dataframe for each metric type
    all_data = []
    
    # Process population data
    for item in population_data:
        melted = pd.melt(df, 
                        id_vars=[id_col], 
                        value_vars=[item['column']],
                        var_name='original_column', 
                        value_name='Value')
        melted['Year'] = item['year']
        melted['Metric'] = item['metric']
        all_data.append(melted)
    
    # Process houses data
    for item in houses_data:
        melted = pd.melt(df, 
                        id_vars=[id_col], 
                        value_vars=[item['column']],
                        var_name='original_column', 
                        value_name='Value')
        melted['Year'] = item['year']
        melted['Metric'] = item['metric']
        all_data.append(melted)
    
    # Process houses per 1000 data
    for item in houses_per_1000_data:
        melted = pd.melt(df, 
                        id_vars=[id_col], 
                        value_vars=[item['column']],
                        var_name='original_column', 
                        value_name='Value')
        melted['Year'] = item['year']
        melted['Metric'] = item['metric']
        all_data.append(melted)
    
    # Step 5: Combine all data
    df_long = pd.concat(all_data, ignore_index=True)
    
    # Step 6: Clean up and reorganize
    df_long = df_long.rename(columns={id_col: 'Area'})
    df_long = df_long[['Area', 'Year', 'Metric', 'Value']]
    
    # Convert Year to integer
    df_long['Year'] = pd.to_numeric(df_long['Year'], errors='coerce')
    
    # Convert Value to numeric
    df_long['Value'] = pd.to_numeric(df_long['Value'], errors='coerce')
    
    # Sort by Area, Year, and Metric
    df_long = df_long.sort_values(['Area', 'Year', 'Metric'])
    df_long = df_long.reset_index(drop=True)
    
    return df_long
# Transform the number of houses per 1000 data
transformed_houses_per_1000 = transform_houses_per_1000_data(number_houses_per1000)
transformed_houses_per_1000.head(10)

    Area  Year                  Metric   Value
0  Busan  1995  Houses per 1000 people   177.5
1  Busan  1995      Population figures  3814.3
2  Busan  1995    The number of houses   677.0
3  Busan  2000  Houses per 1000 people   226.7
4  Busan  2000      Population figures  3662.9
5  Busan  2000    The number of houses   830.2
6  Busan  2005  Houses per 1000 people   329.5
7  Busan  2005      Population figures  3523.6
8  Busan  2005    The number of houses  1161.0
9  Busan  2010  Houses per 1000 people   364.0

In [419]:
transformed_houses_per_1000.tail(3)

              Area  Year                Metric    Value
1197  Whoe Country  2023    Population figures  51774.5
1198  Whoe Country  2023  The number of houses      0.0
1199  Whoe Country  2023  The number of houses  22623.9

In [420]:
transformed_house_ownership.isnull().sum()

Residential_Area     0
Year                 0
Household_Type       0
Count               27
dtype: int64

In [421]:
transformed_house_ownership.to_csv('/home/unsmartboy/Documents/housing_forecast/processed_data/house_ownership_nonownership.csv', index=False)

In [422]:
transaction_based_index.head()

,Area(1),Area(2),2006.01,2006.02,2006.03,2006.04,2006.05,2006.06,2006.07,2006.08,...,2024.06,2024.07,2024.08,2024.09,2024.10,2024.11,2024.12,2025.01,2025.02,2025.03 p)
0,Area(1),Area(2),Price Indices (2017.11 = 100.0),Price Indices (2017.11 = 100.0),Price Indices (2017.11 = 100.0),Price Indices (2017.11 = 100.0),Price Indices (2017.11 = 100.0),Price Indices (2017.11 = 100.0),Price Indices (2017.11 = 100.0),Price Indices (2017.11 = 100.0),...,Price Indices (2017.11 = 100.0),Price Indices (2017.11 = 100.0),Price Indices (2017.11 = 100.0),Price Indices (2017.11 = 100.0),Price Indices (2017.11 = 100.0),Price Indices (2017.11 = 100.0),Price Indices (2017.11 = 100.0),Price Indices (2017.11 = 100.0),Price Indices (2017.11 = 100.0),rates (%)
1,The Whole Country,Sub Summary,60.0,60.5,61.2,61.7,62.0,62.5,62.6,63.5,...,123.4,124.3,125.1,125.2,125.2,124.7,124.1,123.8,124.3,0.30
2,Seoul Metropolitan Area,Sub Summary,62.8,63.7,64.8,65.6,66.2,66.5,66.8,67.8,...,143.8,145.7,147.3,147.5,147.4,146.9,146.1,146.1,147.1,0.55
3,Non-Seoul Metropolitan Area,Sub Summary,57.7,57.6,57.7,57.7,57.7,58.4,58.3,58.8,...,106.4,106.5,106.6,106.8,106.8,106.3,105.8,105.4,105.3,0.01
4,Seoul,Seoul,58.4,59.4,60.9,61.6,61.8,61.8,62.2,63.0,...,164.1,167.8,170.5,170.8,170.8,171.0,170.4,170.9,173.4,0.75

In [423]:
def transform_transaction_index_data(df):
    """
    Transform transaction-based index data from wide format to long format.
    This handles the structure where:
    - First two columns are Area(1) and Area(2) for hierarchical location info
    - Remaining columns are dates (YYYY.MM) with price indices
    
    Parameters:
    df (pandas.DataFrame): Input dataframe with dates as columns
    
    Returns:
    pandas.DataFrame: Transformed dataframe with dates in a single column
    """
    
    # Step 1: Identify ID columns (the area columns)
    id_vars = ['Area(1)', 'Area(2)']
    
    # Step 2: Get all date columns (all columns except the ID columns)
    date_columns = [col for col in df.columns if col not in id_vars]
    
    # Step 3: Melt the dataframe to long format
    df_long = pd.melt(df, 
                      id_vars=id_vars, 
                      value_vars=date_columns,
                      var_name='Date', 
                      value_name='Price_Index'
    )
    
    # Skip the first row which contains header information
    df_long = df_long[df_long['Price_Index'] != 'Price Indices (2017.11 = 100.0)']
    
    # Step 4: Parse the Date column to extract Year and Month
    # Dates are in format YYYY.MM
    df_long[['Year', 'Month']] = df_long['Date'].str.split('.', expand=True)
    
    # Convert to integers - handle the float conversion carefully
    df_long['Year'] = pd.to_numeric(df_long['Year'], errors='coerce').astype('Int64')
    # Make sure Month is converted to integer properly (with NaN handling)
    df_long['Month'] = pd.to_numeric(df_long['Month'], errors='coerce').astype('Int64')
    
    # Step 5: Create a proper datetime column - handle missing values
    # Create a function to safely create date strings
    def create_date_string(row):
        if pd.isna(row['Year']) or pd.isna(row['Month']):
            return pd.NaT
        try:
            # Use integer formatting to avoid decimal points
            year = int(row['Year'])
            month = int(row['Month'])
            return pd.Timestamp(year=year, month=month, day=1)
        except:
            return pd.NaT
    
    # Apply the function to create datetime values
    df_long['Date_Full'] = df_long.apply(create_date_string, axis=1)
    
    # Convert Price_Index to numeric
    df_long['Price_Index'] = pd.to_numeric(df_long['Price_Index'], errors='coerce')
    
    # Step 6: Rename columns for clarity
    df_long = df_long.rename(columns={
        'Area(1)': 'Primary_Area',
        'Area(2)': 'Sub_Area'
    })
    
    # Step 7: Reorder columns
    df_long = df_long[['Primary_Area', 'Sub_Area', 'Date_Full', 'Year', 'Month', 'Price_Index']]
    
    # Step 8: Sort by area and date
    df_long = df_long.sort_values(['Primary_Area', 'Sub_Area', 'Date_Full'])
    
    # Reset index
    df_long = df_long.reset_index(drop=True)
    
    return df_long
# Transform the transaction-based index data
transformed_transaction_index = transform_transaction_index_data(transaction_based_index)
transformed_transaction_index.head(10)

          Primary_Area Sub_Area  Date_Full  Year  Month  Price_Index
0              Area(1)  Area(2)        NaT  2025   <NA>          NaN
1  Metropolitan Cities  Busan   2006-01-01  2006      1         47.9
2  Metropolitan Cities  Busan   2006-02-01  2006      2         47.8
3  Metropolitan Cities  Busan   2006-03-01  2006      3         47.4
4  Metropolitan Cities  Busan   2006-04-01  2006      4         47.1
5  Metropolitan Cities  Busan   2006-05-01  2006      5         46.7
6  Metropolitan Cities  Busan   2006-06-01  2006      6         46.9
7  Metropolitan Cities  Busan   2006-07-01  2006      7         46.8
8  Metropolitan Cities  Busan   2006-08-01  2006      8         46.9
9  Metropolitan Cities  Busan   2006-09-01  2006      9         46.9

In [424]:
transformed_house_ownership.isnull().sum()

Residential_Area     0
Year                 0
Household_Type       0
Count               27
dtype: int64

In [425]:
# drop NaN and empty values in Price_Index
transformed_transaction_index = transformed_transaction_index.dropna(subset=['Price_Index'])
transformed_transaction_index.head(10)

           Primary_Area Sub_Area  Date_Full  Year  Month  Price_Index
1   Metropolitan Cities  Busan   2006-01-01  2006      1         47.9
2   Metropolitan Cities  Busan   2006-02-01  2006      2         47.8
3   Metropolitan Cities  Busan   2006-03-01  2006      3         47.4
4   Metropolitan Cities  Busan   2006-04-01  2006      4         47.1
5   Metropolitan Cities  Busan   2006-05-01  2006      5         46.7
6   Metropolitan Cities  Busan   2006-06-01  2006      6         46.9
7   Metropolitan Cities  Busan   2006-07-01  2006      7         46.8
8   Metropolitan Cities  Busan   2006-08-01  2006      8         46.9
9   Metropolitan Cities  Busan   2006-09-01  2006      9         46.9
10  Metropolitan Cities  Busan   2006-10-01  2006     10         47.1

In [426]:
transformed_house_ownership.tail(10)

    Residential_Area  Year              Household_Type       Count
503    Whole country  2020            Total households  20926710.0
504    Whole country  2021  House ownership households  12062871.0
505    Whole country  2021    Non-ownership households   9385592.0
506    Whole country  2021            Total households  21448463.0
507    Whole country  2022  House ownership households  12232407.0
508    Whole country  2022    Non-ownership households   9541100.0
509    Whole country  2022            Total households  21773507.0
510    Whole country  2023  House ownership households  12454684.0
511    Whole country  2023    Non-ownership households   9618474.0
512    Whole country  2023            Total households  22073158.0

In [427]:
transformed_house_ownership.to_csv('/home/unsmartboy/Documents/housing_forecast/processed_data/house_ownership_nonownership.csv', index=False)

In [428]:
unsold_housing.head()

,Classification(1),Classification(1).1,2001,2002,2003,2004,2005,2006,2007,2008,...,2015,2016,2017,2018,2019,2020,2021,2022,2023,2024
0,unsold By sector,Total,0,0,0,0,0,0,112254,165599,...,61512,56413,57330,58838,47797,19005,17710,68107,62489,70173
1,unsold By sector,Private Sector,0,0,0,0,0,0,110715,164293,...,61512,56413,57330,58838,47797,19005,17710,68107,62489,70173
2,unsold By sector,Public Sector,0,0,0,0,0,0,1539,1306,...,0,0,0,0,0,0,0,0,0,0
3,unsold By sector,After Construction,0,0,0,0,0,0,17395,46476,...,10518,10011,11720,16738,18065,12006,7449,7518,10857,21480
4,unsold By si-do,Whole Country,31512,24923,38261,69133,57215,73772,112254,165599,...,61512,56413,57330,58838,47797,19005,17710,68107,62489,70173

In [429]:
unsold_housing.tail()

,Classification(1),Classification(1).1,2001,2002,2003,2004,2005,2006,2007,2008,...,2015,2016,2017,2018,2019,2020,2021,2022,2023,2024
25,unsold By size,Under 60㎡,0,0,0,0,0,0,5764,7294,...,9336,9128,9919,9308,9044,4640,-,-,-,-
26,unsold By size,60-85㎡,0,0,0,0,0,0,53528,69924,...,43690,40574,41709,44142,34920,13665,12502,50589,44429,50468
27,unsold By size,Over 85㎡,0,0,0,0,0,0,52962,88381,...,8486,6711,5702,5388,3833,700,1019,7092,8633,10348
28,unsold By size,Under 40㎡,-,-,-,-,-,-,-,-,...,-,-,-,-,-,-,1710,2421,2228,2160
29,unsold By size,40?60㎡,-,-,-,-,-,-,-,-,...,-,-,-,-,-,-,2479,8005,7199,7197

In [430]:
def transform_unsold_housing_data(df):
    """
    Transform unsold housing data from wide format to long format.
    
    Parameters:
    df (pandas.DataFrame): Input dataframe with years as columns
    
    Returns:
    pandas.DataFrame: Transformed dataframe with years in a single column
    """
    
    # Step 1: Identify ID columns
    id_vars = ['Classification(1)', 'Classification(1).1']
    
    # Step 2: Get all year columns (all columns except the ID columns)
    year_columns = [col for col in df.columns if col not in id_vars]
    
    # Step 3: Melt the dataframe to long format
    df_long = pd.melt(df, 
                      id_vars=id_vars, 
                      value_vars=year_columns,
                      var_name='Year', 
                      value_name='Unsold_Units')
    
    # Step 4: Rename columns for clarity
    df_long = df_long.rename(columns={
        'Classification(1)': 'Category',
        'Classification(1).1': 'Subcategory'
    })
    
    # Step 5: Convert Year to integer
    df_long['Year'] = pd.to_numeric(df_long['Year'], errors='coerce')
    
    # Step 6: Convert Unsold_Units to numeric, handling '-' as NaN
    df_long['Unsold_Units'] = pd.to_numeric(df_long['Unsold_Units'], errors='coerce')
    
    # Step 7: Sort by category, subcategory, and year
    df_long = df_long.sort_values(['Category', 'Subcategory', 'Year'])
    
    # Reset index
    df_long = df_long.reset_index(drop=True)
    
    return df_long


df_transformed = transform_unsold_housing_data(unsold_housing)
df_transformed.head(20)

            Category         Subcategory  Year  Unsold_Units
0   unsold By sector  After Construction  2001           0.0
1   unsold By sector  After Construction  2002           0.0
2   unsold By sector  After Construction  2003           0.0
3   unsold By sector  After Construction  2004           0.0
4   unsold By sector  After Construction  2005           0.0
5   unsold By sector  After Construction  2006           0.0
6   unsold By sector  After Construction  2007       17395.0
7   unsold By sector  After Construction  2008       46476.0
8   unsold By sector  After Construction  2009       50087.0
9   unsold By sector  After Construction  2010       42655.0
10  unsold By sector  After Construction  2011       30881.0
11  unsold By sector  After Construction  2012       28778.0
12  unsold By sector  After Construction  2013       21751.0
13  unsold By sector  After Construction  2014       16267.0
14  unsold By sector  After Construction  2015       10518.0
15  unsold By sector  After Construction  2016       10011.0
16  unsold By sector  After Construction  2017       11720.0
17  unsold By sector  After Construction  2018       16738.0
18  unsold By sector  After Construction  2019       18065.0
19  unsold By sector  After Construction  2020       12006.0

In [431]:
df_transformed.tail(3)

           Category Subcategory  Year  Unsold_Units
717  unsold By size   Under 60㎡  2022           NaN
718  unsold By size   Under 60㎡  2023           NaN
719  unsold By size   Under 60㎡  2024           NaN

In [432]:
number_houses_per1000.head()

,Classification(1),1995,1995.1,1995.2,2000,2000.1,2000.2,2005,2005.1,2005.2,...,2022.2,2022.3,2022.4,2022.5,2023,2023.1,2023.2,2023.3,2023.4,2023.5
0,Classification(1),Population figures,The number of houses,The number of houses per 1000 people,Population figures,The number of houses,The number of houses per 1000 people,Population figures,The number of houses,The number of houses per 1000 people,...,The number of houses per 1000 people,Number of population,,,Population figures,The number of houses,The number of houses per 1000 people,Number of population,,
1,Whoe Country,44608.7,9570.4,214.5,46136.1,11472.4,248.7,47279.0,15622.5,330.4,...,0.0,51692.3,22236.9,430.2,0.0,0.0,0.0,51774.5,22623.9,437.0
2,Capital Area,20189.1,3859.4,191.2,21354.5,4731.2,221.6,22766.9,7165.0,314.7,...,0.0,26124.4,10357.8,396.5,0.0,0.0,0.0,26225.8,10573.7,403.2
3,Seoul,10231.2,1727.9,168.9,9895.2,1973.2,199.4,9820.2,3102.2,315.9,...,0.0,9417.5,3839.8,407.7,0.0,0.0,0.0,9384.5,3878.5,413.3
4,Busan,3814.3,677.0,177.5,3662.9,830.2,226.7,3523.6,1161.0,329.5,...,0.0,3295.8,1485.6,450.8,0.0,0.0,0.0,3279.6,1505.4,459.0

In [433]:
number_houses_per1000.tail()

,Classification(1),1995,1995.1,1995.2,2000,2000.1,2000.2,2005,2005.1,2005.2,...,2022.2,2022.3,2022.4,2022.5,2023,2023.1,2023.2,2023.3,2023.4,2023.5
15,Jeollabuk-do,1902.0,496.1,260.8,1890.7,568.6,300.7,1784.0,638.4,357.9,...,0.0,1774.3,849.1,478.5,0.0,0.0,0.0,1768.5,859.3,485.9
16,Jeollanam-do,2066.8,606.4,293.4,1996.5,647.0,324.1,1819.8,692.3,380.4,...,0.0,1771.4,881.7,497.7,0.0,0.0,0.0,1776.7,893.0,502.6
17,Gyeongsangbuk-do,2676.3,723.2,270.2,2724.9,824.7,302.7,2607.6,965.4,370.2,...,0.0,2620.4,1320.7,504.0,0.0,0.0,0.0,2589.9,1319.7,509.6
18,Gyeongsangnam-do,3845.6,897.8,233.5,2978.5,822.3,276.1,3056.4,1062.1,347.5,...,0.0,3280.8,1522.6,464.1,0.0,0.0,0.0,3271.2,1532.2,468.4
19,Jeju,505.4,114.2,226.0,513.3,127.6,248.5,531.9,172.0,323.4,...,0.0,676.4,288.0,425.8,0.0,0.0,0.0,676.8,293.2,433.2

In [ ]:
# Clean datasets by removing rows with NaN, empty values, or zeros
def clean_dataframe(df, name="DataFrame"):
    """
    Remove rows with NaN, empty strings, or zeros from a DataFrame.
    Returns the cleaned DataFrame and prints info about removed rows.
    """
    if df.empty:
        print(f"{name} is empty, skipping cleanup.")
        return df
        
    initial_rows = len(df)
    
    # Drop rows with NaN values
    df_no_nan = df.dropna()
    nan_removed = initial_rows - len(df_no_nan)
    
    # For non-numeric columns, drop rows with empty strings
    for col in df_no_nan.select_dtypes(include=['object']).columns:
        df_no_nan = df_no_nan[df_no_nan[col].str.strip() != ""]
    empty_removed = initial_rows - nan_removed - len(df_no_nan)
    
    # For numeric columns, drop rows where value is 0
    numeric_cols = df_no_nan.select_dtypes(include=['number']).columns
    if len(numeric_cols) > 0:
        # Create a mask where all numeric values in a row are 0
        zeros_mask = (df_no_nan[numeric_cols] == 0).all(axis=1)
        df_no_nan = df_no_nan[~zeros_mask]
    zeros_removed = initial_rows - nan_removed - empty_removed - len(df_no_nan)
    
    print(f"Cleaned {name}:")
    print(f"  - Initial rows: {initial_rows}")
    print(f"  - Rows with NaN removed: {nan_removed}")
    print(f"  - Rows with empty strings removed: {empty_removed}")
    print(f"  - Rows with all zeros removed: {zeros_removed}")
    print(f"  - Remaining rows: {len(df_no_nan)}")
    
    return df_no_nan

# Clean all datasets
print("Cleaning datasets...")
if not government_supported_housing.empty:
    government_supported_housing = clean_dataframe(government_supported_housing, "government_supported_housing")
housing_price_index1 = clean_dataframe(housing_price_index1, "housing_price_index1")
housing_price_index2 = clean_dataframe(housing_price_index2, "housing_price_index2")
housing_price_index3 = clean_dataframe(housing_price_index3, "housing_price_index3")
expenses_by_year1 = clean_dataframe(expenses_by_year1, "expenses_by_year1")
expenses_by_year2 = clean_dataframe(expenses_by_year2, "expenses_by_year2")
housing_price_index_by_housingtype = clean_dataframe(housing_price_index_by_housingtype, "housing_price_index_by_housingtype")
number_house_owners_byage = clean_dataframe(number_house_owners_byage, "number_house_owners_byage")
house_ownership_nonownership = clean_dataframe(house_ownership_nonownership, "house_ownership_nonownership")
number_houses_per1000 = clean_dataframe(number_houses_per1000, "number_houses_per1000")
transaction_based_index = clean_dataframe(transaction_based_index, "transaction_based_index")
unsold_housing = clean_dataframe(unsold_housing, "unsold_housing")

print("All datasets cleaned!")